import React from 'react'
import Blogs from './Blogs';
import { useState, useEffect } from 'react';
import Circle from './Circle';
// import '../fonts/ar-archy-regular.ttf';

import Map from './Map';

function Home() {
    const [blogs , setBlogs] = useState([
        { 
            title: "გორის ძველი არქიტექტურული სახე" ,
            body: "გორის ძველი არქიტექტურული სახე ეკოლოგიური და ისტორიული კატასტროფების შედეგად თითქმის ბოლომდეა დაკარგული. ჯერ...",
            innerBody: "გორის ძველი არქიტექტურული სახე ეკოლოგიური და ისტორიული კატასტროფების შედეგად თითქმის ბოლომდეა დაკარგული. ჯერ 1920 წლის მიწისძვრამ, ხოლო შემდეგ საბჭოთა პერიოდის ქალაქთმშენებლობამ მნიშვნელოვნად შეცვალა ქალაქის ვიზუალი. ზოგი ღირსშესანიშნაობების პირვანდელი სახელი მხოლოდ ილუსტრაციებზეა შემორჩენილი - მაგალითად, გორის ციხის. ისტორიკოსი ელდარ მამისთვალიშვილი მოგვითხრობს , რა სახით შეხვდა გორი მე-20 საუკუნეს და რა ცვლილებებს დაექვემდებარა იგი შემდგომი ათწლეულების განმავლობაში.",
            img: "/images/1.png",
            id: 1
        },
        { 
            title: "“ომის მეხსიერება ქალაქში”" ,
            body: "2008 წლის ომთან დაკავშირებით, შიდა ქართლში, ზოგადი ცნობიერების ამაღლების მიზნით, 2022 წლის ივლისში გამოცხადდა...",
            innerBody: "2008 წლის ომთან დაკავშირებით, შიდა ქართლში, ზოგადი ცნობიერების ამაღლების მიზნით, 2022 წლის ივლისში გამოცხადდა კონკურსი “ომის მეხსიერება ქალაქში”. IDFI-სა და ZINC Network-ის მიერ გამოცხადებული კონკურსის მთავარი მიზანი სწორედ ახალგაზრდა თაობის მეხსიერებისა და ემოციების გაზიარების საშუალებით, ქალაქ გორის გარშემო ფიზიკურ სივრცეში ახალგაზრდების შექმნილი ნამუშევრის დატანით, ომის მეხსიერების თემაზე ჯანსაღი და ინფორმირებული დისკუსიის წახალისება იყო. Კონკურსს სამი გამარჯვებული ჰყავს, პირველ ადგილზე გასული კი 17 წლის გიორგი ტეტუნაშვილია. Მისი ჩანახატი იტევს გამძლეობის, შეუპოვრობისა და მომავლის იმედის სიმბოლურ მნიშვნელობას. Ასკიზი ასახავს ომის სისასტიკის შედეგების ფონზე, ადამიანს, რომელიც ცდილობს ნერგი თავიდან გაახაროს, სიცოცხლე გააგრძელოს და მავთულხლართებთან ასეთი სიახლოვის მიუხედავად, შეუპოვრად განაგრძოს თავისი საქმე. Ესკიზის ავტორის ინტერპრეტაციით: “მიუხედავად იმისა, თუ როგორ გაგანადგურეს, მთავარია იმედი აღორძინებისა”. Სწორედ ეს ციტატა ახლავს თან მიურალს, რომელიც ქალაქ გორში, კირიონ II-ს ქუჩაზე არის განთავსებული. Მიურალის გახსნა ქალაქ გორში სიმბოლურად, 2022 წლის 7 აგვისტოს გაიმართა.",
            img: "/images/2.png",
            id: 2
        },
        { 
            title: "ისტორიული და დემოკრატიული პროცესები გორში" ,
            body: "გორის ძველი არქიტექტურული სახე ეკოლოგიური და ისტორიული კატასტროფების შედეგად თითქმის ბოლომდეა დაკარგული. ჯერ...",
            innerBody: "იმპერიის ცენტრში აღმოცენებულმა “ნაროდნიკულმა” მოძრაობამ საქართველომდეც მოაღწია და ფეხი ყველაზე კარგად გორში მოიკიდა. გლეხების სახელით თავად-აზნაურობისა და მონარქიული წყობილების წინააღმდეგ ამხედრებული ხალხოსნები გორში ხალხთან მუშაობას 1870-იანი წლებიდან იწყებენ. იქმნებოდა ლიტერატურული წრეები და საზოგადოებები, ადგილობრივი ინტელიგენცია კი აქტიურად ავრცელებდა ხალხოსნურ იდეებს გორის მაზრის მცხოვრებებში.საკუთარ კარმიდამოსა და მოკრძალებულ სივრცეებში დემოკრატიული, სამოქალაქო იდეების გავრცელება ტალღასავით აგორდა, თუმცა 1876 წელს ხალხოსანთა წრე გამჟღავნდა და ლიდერების მნიშვნელოვანი ნაწილი დაამპატიმრეს. ვინც კი დაპატიმრებას გადაურჩა, ფარ-ხმალი არ დაუყრია და დაწყებული საქმიანობა განაგრძო. იქმნება “ქართული ისტორიისა და ლიტერატურის შესწავლის საზოგადოება”, რომლის წევრები სკოლებში არალეგალურად ავრცელებდნენ ხალხოსნურ იდეებსა და აკრძალულ ლიტერატურას. საქართველოს დამოუკიდებელი რესპუბლიკის შექმნასთან ერთად მთელ საქართველოში, მათ შორის, გორში ძლიერდება ადგილობრივი თვითთმართველობები, სადაც მოქალაქეები აქტიურად მონაწილეობენ არჩევნებსა და საზოგადოებრივი საკითხების განხილვაში. გორის საქალაქო არჩევნებში მონაწილე პარტიები საკუთარ საარჩევნო სიებს ადგილობრივი პრესის მეშვეობით ავრცელებდნენ. 1917-1921 წლების განმავლობაში გორში ჩატარდა რუსეთის დამფუძნებელი კრების, 2 საქალაქო, საერობო და საქართველოს დამფუძნებელი კრების არჩევნები. საბჭოთა რუსეთის მიერ საქართველოს ოკუპაციის შემდეგ კი, როგორც მთელს საბჭოეთში, გორშიც დემოკრატიული არჩევნების ტრადიცია მოისპო. ტოტალიტარული რეჟიმი, ფიქტიურ არჩევნებში მონაწილეობასაც კი უკრძალავდა მოქალაქეთა გარკვეულ ჯგუფებს და მათ “ხმის უფლება ჩამორთმეულად”, იგივე “შავსიელად” აცხადებდა. არქივები არერთს ისეთ წერილს ინახავს, რომელშიც ქალაქის მცხოვრებები ადმინისტრაციას მიმართავენ, რომ შეცდომით, ან უსამართლოდ სიაში ვერმოხვედრის გამო ჩამორთმეული ხმის მიცემის უფლება აღუდგინონ. ათწლეულების მანძილზე ქალაქ გორსა და მაზრაში მომხდარი მოვლენები, რომლებიც ხალხოსნურ, ქალთა თუ საარჩევნო პერიპეტიებს მოიცავდა, ადასტურებს, რომ იმპერიის მძიმე უღელში, გამოწვევებით სავსე დამოუკიდებლობასა თუ ფორმალური საბჭოთა არჩევნების პირობებშიც კი შესაძლებელია მონდომებულ მოქალაქეთა დემოკრატიული მოქმედებები უყურადღებოდ და უშედეგოდ არ დარჩეს.",
            img: "/images/3.png",
            id: 3
        },
        { 
            title: "ვაჟა-ფშაველა და გორი" ,
            body: "გორის ძველი არქიტექტურული სახე ეკოლოგიური და ისტორიული კატასტროფების შედეგად თითქმის ბოლომდეა დაკარგული. ჯერ...",
            innerBody: "ქართულ საზოგადოებაში შემორჩენილია ღრმა რწმენა, რომ ვაჟა-ფშაველა საქართველოს მხოლოდ მთამ აჩუქა. რა თქმა უნდა, ვაჟას ცხოვრებაში მთას უდიდესი გავლენა ჰქონდა. თუმცა სანამ ლუკა რაზიკაშვილი ვაჟა-ფშაველად იქცეოდა, მისი პიროვნების შენებაში უამრავმა ადგილმა და საზოგადოებამ შეიტანა წვლილი. გორის სამასწავლებლო სემინარიაში ვაჟა-ფშაველა 18 წლის ასაკში ჩაირიცხა. ამ პერიოდში სემინარია მიიჩნეოდა იმ ერთ-ერთ იშვიათ სასწავლებლად, სადაც იმპერიული იდეოლოგიზაცია შედარებით შესუსტებული იყო. თავდაპირველად ვაჟას ხშირად ხედავდნენ ხალხოსნების წრეებში, სადაც დაუახლოვდა მოძრაობის ერთ-ერთ მთავარ ინიციატორს - მიშო ყიფიანს. არაერთი ამბავია შემორჩენილი როგორც მისი ფიცხი ხასიათის, ხელჩართული ჩხუბების, ასევე დაუღალავი მოხალისეობის შესახებ გორის მიმდებარე სოფლების დასახმარებლად.თუმცა ვაჟას პოლიტიკური ინტერესი მალე განელდა და მისი ყურადღება თითქმის მთლიანად ლიტერატურამ გადაიზიდა თავისუფალ დროს გამუდმებით კითხულობდა სემინარიის კაკლის ხის ძირში :პლატონი, ჰერაკლიტე, ბეკონი, კანტი, ბორელი, სპენსერი, გოეთე,ჰომეროსი, ვირგილიუსი, დანტე, შექსპირი, ბაირონი და სხვები. ვაჟას ინტერესები ყველა სფეროს წვდებოდა - ძველი ქართული ლიტერატურიდან ასტრონომიის წიგნებამდე. ამგვარად, შეიძლება ითქვას, რომ გორმა შექმნა ვაჟა-ფშაველას გონებაში ინტელექტუალური ბირთვი, რომელიც მოგვიანებით ქართულ და მსოფლიო კულტურას ჰუმანისტური ლიტერატურის შედევრებს დაუტოვებდა. მაგრამ გარდა ამისა, ვაჟას სხვა მნიშვნელოვანი კავშირიც ჰქონდა გორთან - ოჯახი. სოფელ ხელთუბანში სახლობდა ვაჟას ძმა - თედო რაზიკაშვილი. თედოც არამხოლოდ სამწერლო საქმიანობას ეწეოდა, არამედ ფოლკლორის შემგროვებელიც იყო. გარდა იმისა, რომ თედომ 3000-ზე მეტი ლექსი და 200მდე ზღაპარი შეაგროვა და შემოინახა, ხალხური სიტყვიერების ლექსიკონიც შეადგინა. სწორედ თედოსთან, გორში გამოაგზავნა ვაჟამ შვილი - ლევანი. ლევანს1923-ში წითელი ხელისუფლება ქაქუცა ჩოლოყაშვილის რაზმისთვის დახმარების ბრალდებით სიკვდილით დასჯის. ალექსანდრე აბაშელმა, შალვა დადინმა და პავლე ინგოროყვამ სერგო ორჯონიკიძეს, ვაჟა-ფშაველას შვილის შეწყალება სთხოვეს. გადმოცემის თანახმად, ორჯონიკიძემ უპასუხა: “ვაჟას შვილი კი არა, თვით ვაჟა რომ იყოს ცოცხალი, იმასაც დავხვრეტდი”. თუმცა, ვაჟა ზედმეტად ძვირფასი ფიგურა იყო ქართული საზოგადოებისთვის. მისი გაქრობა ასე უბრალოდ ვერ მოხერხდებოდა. სამაგიეროდ, გააქრეს ლევანი - არც მისი საფლავის მდებარეობაა ცნობილი და მამასთან ერთად გადაღებული ფოტოებიდანაც ამოშალეს. უდაოა, რომ თავისუფალ საქართველოში ვაჟას შთამომავლებისთვის დიდი სიამაყის წყარო იქნებოდა რაზიკაშვილების გვარისთვის მიკუთვნება. თუმცა, საბჭოთა სისტემამ ლევანის შვილებსა და ოჯახისთვის ეს წარმომავლობა შერცხვენისა და შიშის ქვეშ ცხოვრების წყაროდ აქცია. მიუხედავად ამისა, დღეს გორში ვაჟას 20-მდე შთამომავალი ცხოვრობს და ცოცხალი სახით მოაქვთ არამხოლოდ თავისი ოჯახისთვის, არამედ საქართველოსთვის მნიშვნელოვანი მეხსიერება, რომლის განადგურებაც საბჭოთა რეპრესიებმა მაინც ვერ მოახერხეს",
            img: "/images/1.png",
            id: 4
        },
        { 
            title: "გორის კულტურული იდენტობა" ,
            body: "გორის ძველი არქიტექტურული სახე ეკოლოგიური და ისტორიული კატასტროფების შედეგად თითქმის ბოლომდეა დაკარგული. ჯერ...",
            innerBody: "მე19 საუკუნის მეორე ნახევარი განსაკუთრებული პერიოდია საქართველოსთვის. ნელ-ნელა ურბანულ სივრცეებში ძველი წეს-წყობილობები ადგილს უთმობენ სამოქალაქო საზოგადოებების ჩამოყალიბებას.თვითმმართველობები, საზოგადოებრივი ჯგუფები და წრეები ამ დროისთვის მთელ დასავლურ სამყაროში ბუნებრივი მოვლენა იყო. თუმცა საქართველოში სამოქალაქო სივრცეებს რუსეთის იმპერიის წნეხქვეშ უწევდათ გაჩენა. ამის მიუხედავად, გორი მაინც ახერხებდა მდიდარი სამოქალაქო და კულტურული იდენტობის შენარჩუნებასა და განვითარებას. ყველაზე პოპულარულ სახალხო ორგანიზაციად ხალხოსნობა იქცა. ხალხოსნები უპირისპირდებოდნენ თავად-აზნაურობას გლეხების სახელით. სოფლებში იხსნებოდა არალეგალური სტამბები, წრეები, რომლებიც თანასწორობის და სოციალური სამართლიანობის იდეებს ავრცელებდნენ. ქართული ხალხოსნობა სწორედ გორიდან იღებს სათავეს. ხალხოსნებთან დაკავშირებული წრეების გარდა, გორში სხვა ბევრი ორგანიზაციაც ჩნდებოდა; მათე კერესელიძის ლიტერატურული წრე “კერესელიძის კერა” კურირებდა კულტურულ დიალოგსა და გაჭირვებული სტუდენტების დახმარებას. რევაზ ერისთავის ინიციატივით აშენდა საქალაქო კლუბი “როტონდა” რომელშიც ეწყობოდა საგანმანათლებლო, კულტურული და საქველმომედო ღონისძიებენი. აქტიურად მოღვაწეობდა 13 ქალის მიერ დაარსებული დაარსებული საზოგადოება “მანდილოსანი”, რომელიც გაჭირვებულ ქალებს მატერიალურად და მორალურად ეხმარებოდა. გორის კულტურულ ცხოვრებაში გამოიკვეთა აქტიური ფიგურები საზოგადოების ყველა ფენიდან, ყველა სივრციდან. გარდა პოლიტიკური მოძრაობებისა და კლუბებისა, გორის კულტურული ცხოვრება სახალხო დღესასწაულებითაც იყო გამდიდრებული. ყეენობა, ჭონა, ლაზარობა, ჭიაკოკონა, ეწყობოდა სახალხო კრივი და ბევრი სხვა რამ. აღსანიშნავია, რომ დღესასწაულებში მთელი ქალაქი იღებდა მონაწილეობას, რელიგიური თუ ეთნიკური ჯგუფის მიუხედავად. თუმცა, საბჭოთა კავშირთან ერთად სახალხო დღესასწაულები და მოძრაობები დაიკარგა. ზოგი ნელ-ნელა დაიშალა, ზოგმა სახე იცვალა, ხოლო ზოგი პირდაპირ აიკრძალა ხელისუფლების მიერ. მე19 საუკუნის მეორე ნახევარში გორის კულტურული გავლენა ყველა შეზღუდვისა და წნეხის მიუხედავად აქტიურად ფართოვდებოდა. შეუძლებელია, უყურებდე ამ პერიოდს და არ გიჩნდებოდეს კითხვა - რა მოხდებოდა, თუ არამხოლოდ გორს, არამედ საქართველოს ყველა სხვა კულტურულ ცენტრს მიეცემოდა თავისუფლად გაზრდისა და განვითარების საშუალება.",
            img: "/images/2.png",
            id: 5
        },
        { 
            title: "გორის ძველი არქიტექტურული სახე" ,
            body: "გორის ძველი არქიტექტურული სახე ეკოლოგიური და ისტორიული კატასტროფების შედეგად თითქმის ბოლომდეა დაკარგული. ჯერ...",
            innerBody: "",
            img: "/images/3.png",
            id: 6
        },
        { 
            title: "გორის ძველი არქიტექტურული სახე" ,
            body: "გორის ძველი არქიტექტურული სახე ეკოლოგიური და ისტორიული კატასტროფების შედეგად თითქმის ბოლომდეა დაკარგული. ჯერ...",
            innerBody: "",
            img: "/images/3.png",
            id: 7
        },
        { 
            title: "გორის ძველი არქიტექტურული სახე" ,
            body: "გორის ძველი არქიტექტურული სახე ეკოლოგიური და ისტორიული კატასტროფების შედეგად თითქმის ბოლომდეა დაკარგული. ჯერ...",
            innerBody: "",
            img: "/images/1.png",
            id: 8
        },
        { 
            title: "გორის ძველი არქიტექტურული სახე" ,
            body: "გორის ძველი არქიტექტურული სახე ეკოლოგიური და ისტორიული კატასტროფების შედეგად თითქმის ბოლომდეა დაკარგული. ჯერ...",
            innerBody: "",
            img: "/images/2.png",
            id: 9
        },
        { 
            title: "გორის ძველი არქიტექტურული სახე" ,
            body: "გორის ძველი არქიტექტურული სახე ეკოლოგიური და ისტორიული კატასტროფების შედეგად თითქმის ბოლომდეა დაკარგული. ჯერ...",
            innerBody: "",
            img: "/images/3.png",
            id: 10
        }
    ]);

    
    
  return (
    <>
    <div className="main_container">
        <div className="content">
            <div className="left">
                <div className="container">
                    <Circle />
                    <h2>გორის კულტურული და ისტორიული პორტრეტი</h2>
                    <div className="more">
                        <p>პროექტის შესახებ</p>
                        <div className="more_info">
                            <h3>საუკუნეთა განმავლობაში გორი იყო ერთ-ერთი ყველაზე საკვანძო ქალაქი საქართველოს ისტორიაში</h3>
                            <span>ნახე მეტი {">>>"}</span>
                        </div>
                    </div>
                </div>
                {/* <Map /> */}
            </div>
            <div className="right">
                    <Circle />
                    <div className="inner_container">
                        <Blogs blogs={blogs} />
                    </div>
            </div>
        </div>
        <footer>
            <p>ვებგვერდი შეიქმნა ინფორმაციის თავისუფლების განვითარების ინსტიტუტის (IDFI) მიერ, ამერიკელი ხალხის დახმარებით, ამერიკის შეერთებული შტატების საერთაშორისო განვითარების სააგენტოსა (USAID) და Zinc Newtork-ის ფინანსური მხარდაჭერით</p>
        </footer>
    </div>
    </>
  )
}

export default Home